#+TITLE: How I built this website
#+DATE: <2021-12-22 Wed>
#+startup: overview
#+SETUPFILE: ../org-template/style.org
#+OPTIONS: num:nil toc:nil

I built this site using Emacs and Org-Mode. The literate programming capabilities built into Org-Mode with Org-Babel were particularly useful for evaluating and rendering the Python source code blocks. The source code for the web site is also available from my [[https://github.com/j-brady/j-brady.github.io][GitHub]] repo. I have laid out some of the important details for putting the page together below and all source files were rendered using Org-mode's ~#+INCLUDE:~ tag ([[https://orgmode.org/manual/Include-Files.html][see docs]]) ensuring that they are up-to-date.

* Org-Mode
To avoid rendering large blocks of source code and cluttering the pages I implemented a "hacky" solution for collapsible source code blocks using a combination of inline HTML, CSS and JavaScript. This is not ideal but is the best that I could manage without expending too much time.

Above each source block I added the following inline HTML:

#+HTML: <button type="button" class="collapsible">Toggle code</button>
#+begin_src org
#+HTML: <button type="button" class="collapsible">Toggle code</button
#+end_src

#+RESULTS:
: #+HTML: <button type="button" class="collapsible">Toggle code</button

For the case where I wanted all code blocks to be hidden by default I added the following HTML and to the bottom of the org-file.

#+HTML: <button type="button" class="collapsible">Toggle code</button>
#+begin_src org
#+HTML_HEAD: <style> .org-src-container {padding: 0 18px; display: none; overflow: hidden; background-color: #f1f1f1;} </style>
#+begin_export html
<script>
    var coll = document.getElementsByClassName("collapsible");
    var i;

    for (i = 0; i < coll.length; i++) {
        coll[i].addEventListener("click", function() {
            this.classList.toggle("active");
            var content = this.nextElementSibling;
            if (content.style.display === "block") {
                content.style.display = "none";
                } else {
                content.style.display = "block";
            }
        });
    }
</script>
#+end_export
#+end_src

In the case where I want the source blocks to be visible by default  (this page) I used the following:

#+HTML: <button type="button" class="collapsible">Toggle code</button>
#+begin_src org
#+begin_export html
<script>
    var coll = document.getElementsByClassName("collapsible");
    var i;

    for (i = 0; i < coll.length; i++) {
        coll[i].addEventListener("click", function() {
            this.classList.toggle("active");
            var content = this.nextElementSibling;
            if (content.style.display === "none") {
                content.style.display = "block";
                } else {
                content.style.display = "none";
            }
        });
    }
</script>
#+end_export
#+end_src



